2025.02.11.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-11 Tue 08:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2025.02.04.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2025.02.18.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of February 04 to 11, 2025.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">ocamlmig, a tool to rewrite ocaml code, and complement <code>[@@deprecated]</code></a></li>
<li><a href="#2">Mopsa 1.1 &#x2013; Modular Open Platform for Static Analysis</a></li>
<li><a href="#3">Other OCaml News</a></li>
<li><a href="#orgceec09b">Old CWN</a></li>
</ul>
</div>
</div>
<div id="outline-container-1" class="outline-2">
<h2 id="1">ocamlmig, a tool to rewrite ocaml code, and complement <code>[@@deprecated]</code></h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ocamlmig-a-tool-to-rewrite-ocaml-code-and-complement-deprecated/16090/1">https://discuss.ocaml.org/t/ann-ocamlmig-a-tool-to-rewrite-ocaml-code-and-complement-deprecated/16090/1</a>
</p>
</div>
<div id="outline-container-orge905243" class="outline-3">
<h3 id="orge905243">v-gb announced</h3>
<div class="outline-text-3" id="text-orge905243">
<p>
Hi,
</p>

<p>
I'm glad to announce ocamlmig, a command line tool for rewriting ocaml source code with access to scope and type information.
</p>

<p>
As the simplest example of what it's intended for, let's say an opam-installed library A provides this interface:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">val</span> <span style="color: #a7601f;">new_name</span> : int -&gt; int

<span style="color: #000000; font-weight: bold;">val</span> <span style="color: #a7601f;">old_name</span> : int -&gt; int
<span style="color: #9f0d0f;">[@@migrate { repl = Rel.new_name }]</span>
</pre>
</div>

<p>
and your repository contains a file b.ml:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">let</span> <span style="color: #007a9f;">_</span> = <span style="color: #444fcf;">A.</span>old_name 1
</pre>
</div>

<p>
then you could run:
</p>

<pre class="example" id="org80ab9f1">
$ git diff b.ml
$ ocamlmig migrate -w
$ git diff b.ml
-let _ = A.old_name 1
+let _ = A.new_name 1
</pre>

<p>
Obviously, it's not limited to renames.
</p>

<p>
When I meant by "complement <code>[@@deprecated]</code>" is that instead of providing a textual description <code>[@@deprecated "please use this thing instead" ]</code> , you get to provide an executable description. The goal is to reduce the friction when the interface of a library evolves. If people get in the habit of running this regularly (after every <code>opam upgrade~/~dune pkg lock</code>, say), then it could also be a way to get users to switch to new interfaces without having to deprecate the old interfaces immediately.
</p>

<p>
Additionally, using that and a couple of other builtin transformations like removing ~open~s, you can execute some refactorings, without learning anything like ppxlib or the ocaml ast, for instance:
</p>

<ul class="org-ul">
<li><a href="https://github.com/v-gb/Gillian/commit/e15ac20a5fac0849dae51523d1b73f1612f976e5">Renaming operators</a> (not easy with sed or the like, because the operators change precedence)</li>
<li><a href="https://github.com/v-gb/ortografe/commit/b0b6a0c323edb67c03ae938d122e73b4f6a8affc">Switching code using both Stdlib and Core to mostly Core</a></li>
</ul>

<p>
If that piqued your interest, here is more information about <a href="https://github.com/v-gb/ocamlmig/blob/main/doc/what.md">what ocamlmig does</a>, and <a href="https://github.com/v-gb/ocamlmig/blob/main/doc/using.md">using it</a>.
</p>

<p>
This is decidedly work in progress, many things are not fully implemented, and it needs a lot of polish, but the existing functionality as is should still be interesting.
</p>
</div>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="2">Mopsa 1.1 &#x2013; Modular Open Platform for Static Analysis</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-mopsa-1-1-modular-open-platform-for-static-analysis/16095/1">https://discuss.ocaml.org/t/ann-mopsa-1-1-modular-open-platform-for-static-analysis/16095/1</a>
</p>
</div>
<div id="outline-container-org3b8271f" class="outline-3">
<h3 id="org3b8271f">Raphaël Monat announced</h3>
<div class="outline-text-3" id="text-org3b8271f">
<p>
Dear all,
</p>

<p>
On behalf of all its developers, I am glad to announce the release of <a href="https://gitlab.com/mopsa/mopsa-analyzer/">Mopsa v1.1</a>! You can just <code>opam install mopsa</code> .
</p>

<p>
<b>What is Mopsa?</b> Mopsa stands for Modular and Open Platform for Static Analysis. It aims at easing the development and use of static analyzers. More specifically, Mopsa is a generic framework for building sound static analyzer based on the theory of abstract interpretation. Mopsa is independent of language and abstraction choices. Developers are free to add arbitrary abstractions (numeric, pointer, memory, etc.) and syntax iterators for new languages. Mopsa encourages the development of independent abstractions which can cooperate or be combined to improve precision.
</p>

<p>
<b>v1.1 changes.</b> This new version brings several expressivity, precision and interface improvements, notably:
</p>

<ul class="org-ul">
<li><a href="https://mopsa.gitlab.io/mopsa-analyzer/user-manual/options/general.html#partitioning">Trace and state partitioning</a>. ⚠️ introduces <a href="https://gitlab.com/mopsa/mopsa-analyzer/-/merge_requests/130#breaking-changes">breaking changes</a> in the API of domains.</li>
<li><a href="https://mopsa.gitlab.io/mopsa-analyzer/user-manual/debugging/automated-testcase-reduction.html">Suggestions to trigger automatic testcase reduction whenever Mopsa crashes</a></li>
<li>* As a side-effect, Mopsa is able to generate preprocessed files from make targets using option <code>-c-preprocess-and-exit=file.i</code>, which might be useful for other users too! This has been experimented on our coreutils benchmarks, and can also be used to generate the preprocessed files used in the <a href="https://gitlab.com/sosy-lab/benchmarking/sv-benchmarks#programs">Software-Verification Benchmarks</a>.</li>
<li>Bash completion support, thanks to <a href="https://opam.ocaml.org/packages/arg-complete/">arg-complete</a> developped by <a href="http://sim642.eu/">Simmo Saan</a>.</li>
</ul>

<p>
<a href="https://gitlab.com/mopsa/mopsa-analyzer/-/blob/fb3fa9bdf9a225f041c8d03dfa248991f92c674d/CHANGELOG.md">Here is the detailed changelog</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="3">Other OCaml News</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgfed7e3f" class="outline-3">
<h3 id="orgfed7e3f">From the ocaml.org blog</h3>
<div class="outline-text-3" id="text-orgfed7e3f">
<p>
Here are links from many OCaml blogs aggregated at <a href="https://ocaml.org/blog/">the ocaml.org blog</a>.
</p>

<ul class="org-ul">
<li><a href="https://tarides.com/blog/2025-02-06-mirageos-on-ocaml-5">MirageOS on OCaml 5!</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgceec09b" class="outline-2">
<h2 id="orgceec09b">Old CWN</h2>
<div class="outline-text-2" id="text-orgceec09b">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe to the <a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a>.
</p>

<div class="authorname" id="org8ffec12">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
